MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2T1073CFL/mcu.h
typedef struct                         /*!< (@ 0x40044200) R_WDT Structure                                            */
{
    union
    {
        __IOM uint8_t WDTRR;           /*!< (@ 0x00000000) WDT Refresh Register                                       */

        struct
        {
            __IOM uint8_t WDTRR : 8;   /*!< [7..0] WDTRR is an 8-bit register that refreshes the down-counter
                                        *   of the WDT.                                                               */
        } WDTRR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t WDTCR;          /*!< (@ 0x00000002) WDT Control Register                                       */

        struct
        {
            __IOM uint16_t TOPS : 2;   /*!< [1..0] Timeout Period Selection                                           */
            uint16_t            : 2;
            __IOM uint16_t CKS  : 4;   /*!< [7..4] Clock Division Ratio Selection                                     */
            __IOM uint16_t RPES : 2;   /*!< [9..8] Window End Position Selection                                      */
            uint16_t            : 2;
            __IOM uint16_t RPSS : 2;   /*!< [13..12] Window Start Position Selection                                  */
            uint16_t            : 2;
        } WDTCR_b;
    };

    union
    {
        __IOM uint16_t WDTSR;           /*!< (@ 0x00000004) WDT Status Register                                        */

        struct
        {
            __IM uint16_t  CNTVAL : 14; /*!< [13..0] Down-Counter Value                                                */
            __IOM uint16_t UNDFF  : 1;  /*!< [14..14] Underflow Flag                                                   */
            __IOM uint16_t REFEF  : 1;  /*!< [15..15] Refresh Error Flag                                               */
        } WDTSR_b;
    };

    union
    {
        __IOM uint8_t WDTRCR;          /*!< (@ 0x00000006) WDT Reset Control Register                                 */

        struct
        {
            uint8_t               : 7;
            __IOM uint8_t RSTIRQS : 1; /*!< [7..7] Reset Interrupt Request Selection                                  */
        } WDTRCR_b;
    };
    __IM uint8_t RESERVED1;

    union
    {
        __IOM uint8_t WDTCSTPR;        /*!< (@ 0x00000008) WDT Count Stop Control Register                            */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t SLCSTP : 1;  /*!< [7..7] Sleep-Mode Count Stop Control                                      */
        } WDTCSTPR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_WDT_Type;                          /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                        R_ACMPHS_B                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief High-Speed Analog Comparator (R_ACMPHS_B)
 */

typedef struct                         /*!< (@ 0x40085E00) R_ACMPHS_B Structure                                       */
{
    union
    {
        __IOM uint8_t COMPMDR0;        /*!< (@ 0x00000000) ACMPHS_B Mode Setting Register 0                           */

        struct
        {
            __IOM uint8_t C0ENB : 1;   /*!< [0..0] Enabling operation of comparator 0                                 */
            __IOM uint8_t C0POE : 1;   /*!< [1..1] VCOUT0 Pin Output Enable                                           */
            uint8_t             : 1;
            __IM uint8_t  C0MON : 1;   /*!< [3..3] Monitoring flag of comparator 0                                    */
            __IOM uint8_t C1ENB : 1;   /*!< [4..4] Enabling operation of comparator 1                                 */
            __IOM uint8_t C1POE : 1;   /*!< [5..5] ACMPHS_B1 VCOUT Pin Output Enable                                  */
            uint8_t             : 1;
            __IM uint8_t C1MON  : 1;   /*!< [7..7] Monitoring flag of comparator 1                                    */
        } COMPMDR0_b;
    };

    union
    {
        __IOM uint8_t COMPFIR0;        /*!< (@ 0x00000001) ACMPHS_B Filter Control Register 0                         */

        struct
        {
            __IOM uint8_t C0FCK : 2;   /*!< [1..0] Selecting the filter for comparator 0                              */
            __IOM uint8_t C0EPO : 1;   /*!< [2..2] Switching the edge sense of comparator 0                           */
            __IOM uint8_t C0EDG : 1;   /*!< [3..3] Selecting the edge detection for comparator 0                      */
            __IOM uint8_t C1FCK : 2;   /*!< [5..4] Selecting the filter for comparator 1                              */
            __IOM uint8_t C1EPO : 1;   /*!< [6..6] Switching the edge sense of comparator 1                           */
            __IOM uint8_t C1EDG : 1;   /*!< [7..7] Selecting the edge detection for comparator 1                      */
        } COMPFIR0_b;
    };

    union
    {
        __IOM uint8_t COMPOCR0;        /*!< (@ 0x00000002) ACMPHS_B Output Control Register 0                         */

        struct
        {
            uint8_t            : 1;
            __IOM uint8_t C0OE : 1;    /*!< [1..1] ACMPHS_B0 VCOUT Pin Output Enable                                  */
            __IOM uint8_t C0OP : 1;    /*!< [2..2] ACMPHS_B0 VCOUT Output Polarity Selection                          */
            uint8_t            : 2;
            __IOM uint8_t C1OE : 1;    /*!< [5..5] VCOUT1 Pin Output Enable                                           */
            __IOM uint8_t C1OP : 1;    /*!< [6..6] ACMPHS_B1 VCOUT Output Polarity Selection                          */
            uint8_t            : 1;
        } COMPOCR0_b;
    };
    __IM uint8_t RESERVED[7];

    union
    {
        __IOM uint8_t CMP0SEL;         /*!< (@ 0x0000000A) Comparator 0 Input Signal Selection Control Register       */

        struct
        {
            __IOM uint8_t C0REFS : 3;  /*!< [2..0] Select the input signal on the negative side of comparator
                                        *   0                                                                         */
            uint8_t             : 3;
            __IOM uint8_t C0INS : 2;   /*!< [7..6] Selecting the input signal on the positive side of comparator
                                        *   0                                                                         */
        } CMP0SEL_b;
    };

    union
    {
        __IOM uint8_t CMP1SEL;         /*!< (@ 0x0000000B) Comparator 1 Input Signal Selection Control Register       */

        struct
        {
            __IOM uint8_t C1REFS : 2;  /*!< [1..0] Comparator Input Selection (Negative side)                         */
            uint8_t              : 6;
        } CMP1SEL_b;
    };
} R_ACMPHS_B_Type;                     /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x40084000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

